# Importación de librerías

In [1]:
import sys
sys.path.append('../')

from src.func_aux_cities import *

# Carga de datos

## Capitales

In [2]:
df = get_df('https://en.wikipedia.org/wiki/List_of_capital_cities_by_elevation')
df.head()

       Country        Capital Elevation (m) Elevation (ft)
0    Bolivia\n       La Paz\n         3,640       11,942\n
1    Ecuador\n        Quito\n         2,850        9,350\n
2   Colombia\n       Bogotá\n         2,625        8,612\n
3   Ethiopia\n  Addis Ababa\n         2,355        7,726\n
4     Bhutan\n      Thimphu\n         2,334        7,657\n

In [3]:
df.Country = df.Country.apply(lambda x:x.split('\n')[0])
df.Capital = df.Capital.apply(lambda x:x.split('\n')[0])
df.drop('Elevation (ft)', axis=1, inplace=True)
df.head()

     Country      Capital Elevation (m)
0    Bolivia       La Paz         3,640
1    Ecuador        Quito         2,850
2   Colombia       Bogotá         2,625
3   Ethiopia  Addis Ababa         2,355
4     Bhutan      Thimphu         2,334

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        195 non-null    object
 1   Capital        195 non-null    object
 2   Elevation (m)  195 non-null    object
dtypes: object(3)
memory usage: 4.7+ KB

In [5]:
df.columns = ['Country', 'City', 'Elevation']
df.Elevation = df.Elevation.apply(lambda x:x.replace(',', ''))
df.Elevation = df.Elevation.apply(lambda x:x.split(' ')[0])
df.Elevation = df.Elevation.astype(int)
df.head()

     Country         City  Elevation
0    Bolivia       La Paz       3640
1    Ecuador        Quito       2850
2   Colombia       Bogotá       2625
3   Ethiopia  Addis Ababa       2355
4     Bhutan      Thimphu       2334

## Otras ciudades

In [6]:
df2 = get_df2('https://en.wikipedia.org/wiki/List_of_cities_by_elevation')

In [7]:
df2.columns = ['Country', 'City', 'Continental', 'Latitude', 'Longitude', 'Population', 'Elevation']
df2.head()

,Country,City,Continental,Latitude,Longitude,Population,Elevation
0,Nepal,Pokhara,Asia,N28.2096,E83.9856,"523,000",822
1,South Africa,Bloemfontein,Africa,S29.116667,E026.216667,"747,431","1,395"
2,China,Shanghai,Asia,N31.2304,E121.4737,"26,320,000",122
3,Nepal,Butwal,Asia,N27.6866,E83.4323,"120,982",150
4,Italy,Milan,Europe,N45.4625,E9.186389,"1,378,689",122

In [8]:
df2.dropna(inplace = True)
df2.reset_index()
df2.head()

,Country,City,Continental,Latitude,Longitude,Population,Elevation
0,Nepal,Pokhara,Asia,N28.2096,E83.9856,"523,000",822
1,South Africa,Bloemfontein,Africa,S29.116667,E026.216667,"747,431","1,395"
2,China,Shanghai,Asia,N31.2304,E121.4737,"26,320,000",122
3,Nepal,Butwal,Asia,N27.6866,E83.4323,"120,982",150
4,Italy,Milan,Europe,N45.4625,E9.186389,"1,378,689",122

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61 entries, 0 to 198
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Country      61 non-null     object
 1   City         61 non-null     object
 2   Continental  61 non-null     object
 3   Latitude     61 non-null     object
 4   Longitude    61 non-null     object
 5   Population   61 non-null     object
 6   Elevation    61 non-null     object
dtypes: object(7)
memory usage: 3.8+ KB

In [10]:
df2.Population = df2.Population.apply(lambda x:x.replace(',', ''))
df2.Elevation = df2.Elevation.apply(lambda x:x.replace(',', ''))
df2.head()

,Country,City,Continental,Latitude,Longitude,Population,Elevation
0,Nepal,Pokhara,Asia,N28.2096,E83.9856,523000,822
1,South Africa,Bloemfontein,Africa,S29.116667,E026.216667,747431,1395
2,China,Shanghai,Asia,N31.2304,E121.4737,26320000,122
3,Nepal,Butwal,Asia,N27.6866,E83.4323,120982,150
4,Italy,Milan,Europe,N45.4625,E9.186389,1378689,122

In [11]:
a = df2[df2.Elevation=='']
df2.drop(65, inplace=True, axis=0)

In [12]:
df2.reset_index()
df2.head()

,Country,City,Continental,Latitude,Longitude,Population,Elevation
0,Nepal,Pokhara,Asia,N28.2096,E83.9856,523000,822
1,South Africa,Bloemfontein,Africa,S29.116667,E026.216667,747431,1395
2,China,Shanghai,Asia,N31.2304,E121.4737,26320000,122
3,Nepal,Butwal,Asia,N27.6866,E83.4323,120982,150
4,Italy,Milan,Europe,N45.4625,E9.186389,1378689,122

In [13]:
df2.Elevation = df2.Elevation.apply(lambda x:x.split(' ')[0]).astype(int)
df2.Population = df2.Population.astype(int)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60 entries, 0 to 198
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Country      60 non-null     object
 1   City         60 non-null     object
 2   Continental  60 non-null     object
 3   Latitude     60 non-null     object
 4   Longitude    60 non-null     object
 5   Population   60 non-null     int64
 6   Elevation    60 non-null     int64
dtypes: int64(2), object(5)
memory usage: 3.8+ KB

In [14]:
# mirar cómo concatenar ambos dataframes

big_df = pd.concat([df2, df], axis=0)
big_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 255 entries, 0 to 194
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Country      255 non-null    object
 1   City         255 non-null    object
 2   Continental  60 non-null     object
 3   Latitude     60 non-null     object
 4   Longitude    60 non-null     object
 5   Population   60 non-null     float64
 6   Elevation    255 non-null    int64
dtypes: float64(1), int64(1), object(5)
memory usage: 15.9+ KB

In [15]:
big_df.drop(['Continental', 'Population'], axis=1, inplace=True)
big_df.head()

        Country          City    Latitude    Longitude  Elevation
0         Nepal       Pokhara    N28.2096     E83.9856        822
1  South Africa  Bloemfontein  S29.116667  E026.216667       1395
2         China      Shanghai    N31.2304    E121.4737        122
3         Nepal        Butwal    N27.6866     E83.4323        150
4         Italy         Milan    N45.4625    E9.186389        122

In [16]:
big_df.Longitude = big_df.Longitude.fillna('_Unknown')
big_df.Latitude = big_df.Latitude.fillna('_Unknown')

In [17]:
big_df.Longitude = big_df.Longitude.astype(str)
big_df.Latitude = big_df.Latitude.astype(str)
big_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 255 entries, 0 to 194
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    255 non-null    object
 1   City       255 non-null    object
 2   Latitude   255 non-null    object
 3   Longitude  255 non-null    object
 4   Elevation  255 non-null    int64
dtypes: int64(1), object(4)
memory usage: 12.0+ KB

In [18]:
big_df.Latitude = big_df.Latitude.apply(lambda x:x[1:])
big_df.Longitude = big_df.Longitude.apply(lambda x:x[1:])
    
big_df.head()

        Country          City   Latitude   Longitude  Elevation
0         Nepal       Pokhara    28.2096     83.9856        822
1  South Africa  Bloemfontein  29.116667  026.216667       1395
2         China      Shanghai    31.2304    121.4737        122
3         Nepal        Butwal    27.6866     83.4323        150
4         Italy         Milan    45.4625    9.186389        122

In [19]:
big_df.Latitude = big_df.Latitude.apply(lambda x:x.replace('°', '').replace('′', '').replace('″',''))
big_df.Longitude = big_df.Longitude.apply(lambda x:x.replace('°', '').replace('′', '').replace('″',''))

In [20]:
big_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 255 entries, 0 to 194
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    255 non-null    object
 1   City       255 non-null    object
 2   Latitude   255 non-null    object
 3   Longitude  255 non-null    object
 4   Elevation  255 non-null    int64
dtypes: int64(1), object(4)
memory usage: 12.0+ KB

In [21]:
big_df.tail()

          Country        City Latitude Longitude  Elevation
190         Tonga  Nuku'alofa  Unknown   Unknown          0
191        Tuvalu      Vaiaku  Unknown   Unknown          0
192       Vanuatu   Port Vila  Unknown   Unknown          0
193   Netherlands   Amsterdam  Unknown   Unknown         -2
194    Azerbaijan        Baku  Unknown   Unknown        -28

#### Vamos a rellenar las latitudes y longitudes de cada ciudad

In [22]:
#len(big_df.City.unique()) #Vemos que hay ciudades repetidas, entonces hay que eliminar los elementos repetidos

In [23]:
'''cols = [['City', 'Location']]
df_def = pd.DataFrame(columns=cols)
df_def.City = list(set(big_df.City))
df_def.shape'''

"cols = [['City', 'Location']]\ndf_def = pd.DataFrame(columns=cols)\ndf_def.City = list(set(big_df.City))\ndf_def.shape"

In [24]:
'''def getting_loc(city):
    geolocator = Nominatim(user_agent="kaaiik")
    location = geolocator.geocode(city, timeout=10000)
    loc = (location.latitude, location.longitude)
    return loc

getting_loc('Dakar')'''

'def getting_loc(city):\n    geolocator = Nominatim(user_agent="kaaiik")\n    location = geolocator.geocode(city, timeout=10000)\n    loc = (location.latitude, location.longitude)\n    return loc\n\ngetting_loc(\'Dakar\')'

In [25]:
'''df_def.Location.fillna('Unknown', inplace=True)
df_def.head()'''

"df_def.Location.fillna('Unknown', inplace=True)\ndf_def.head()"

In [26]:
'''lst_loc = []

for i in range(df_def.shape[0]):
    city = str(df_def.City.loc[i]).split('    ')[1].split('\n')[0]
    loc = get_location(city)
    lst_loc.append(loc)
    
lst_loc'''

"lst_loc = []\n\nfor i in range(df_def.shape[0]):\n    city = str(df_def.City.loc[i]).split('    ')[1].split('\n')[0]\n    loc = get_location(city)\n    lst_loc.append(loc)\n    \nlst_loc"

In [27]:
'''df_def.Location=lst_loc
    
df_def.head()'''

'df_def.Location=lst_loc\n    \ndf_def.head()'

In [28]:
#df_def.to_csv('../data/locations.csv') #lo exporto porque tarda muchisimo en ejecutar con el geopy

In [29]:
df_def = pd.read_csv('../data/locations.csv')
df_def.drop('Unnamed: 0', axis=1, inplace=True)
df_def.head()

        City                        Location
0  Kathmandu     ('27.708317', '85.3205817')
1  Port Vila  ('-17.7414972', '168.3150163')
2  Stockholm    ('59.3251172', '18.0710935')
3   Belgrade    ('44.8178131', '20.4568974')
4   Curitiba  ('-25.4295963', '-49.2712724')

In [30]:
df_def = df_def.dropna()
df_def.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 228 entries, 0 to 229
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      228 non-null    object
 1   Location  228 non-null    object
dtypes: object(2)
memory usage: 5.3+ KB

In [31]:
city = 'Madrid'
url = f'https://nominatim.openstreetmap.org/search?city={city}&format=json&accept-language=en&zoom=3'

result = requests.get(url=url).json()
print(result[0])

{'place_id': 285039864, 'licence': 'Data © OpenStreetMap contributors, ODbL 1.0. https://osm.org/copyright', 'osm_type': 'relation', 'osm_id': 5326784, 'boundingbox': ['40.3119774', '40.6437293', '-3.8889539', '-3.5179163'], 'lat': '40.4167047', 'lon': '-3.7035825', 'display_name': 'Madrid, Área metropolitana de Madrid y Corredor del Henares, Community of Madrid, Spain', 'class': 'boundary', 'type': 'administrative', 'importance': 0.8680703794097986, 'icon': 'https://nominatim.openstreetmap.org/ui/mapicons//poi_boundary_administrative.p.20.png'}

In [32]:
df_def.Location = df_def.Location.apply(lambda x:x.replace('(','').replace(')', '').replace('\'', ''))
df_def.head()

        City                  Location
0  Kathmandu     27.708317, 85.3205817
1  Port Vila  -17.7414972, 168.3150163
2  Stockholm    59.3251172, 18.0710935
3   Belgrade    44.8178131, 20.4568974
4   Curitiba  -25.4295963, -49.2712724

In [33]:
df_def.Location = df_def.Location.apply(tupler)
df_def.head()

        City                    Location
0  Kathmandu     (27.708317, 85.3205817)
1  Port Vila  (-17.7414972, 168.3150163)
2  Stockholm    (59.3251172, 18.0710935)
3   Belgrade    (44.8178131, 20.4568974)
4   Curitiba  (-25.4295963, -49.2712724)

In [34]:
df_def.Location = df_def.Location.apply(floater)
df_def.head()

        City                    Location
0  Kathmandu     (27.708317, 85.3205817)
1  Port Vila  (-17.7414972, 168.3150163)
2  Stockholm    (59.3251172, 18.0710935)
3   Belgrade    (44.8178131, 20.4568974)
4   Curitiba  (-25.4295963, -49.2712724)

In [35]:
def getting_alt(city, cord):
    
    url = f'https://nominatim.openstreetmap.org/search?city={city}&format=json&accept-language=en&zoom=3'
    raw = requests.get(url=url).json()
    
    loc = Location(city, cord, raw)
    alt = loc.altitude
    return alt

getting_alt('Curitiba', (-25.4295963, -49.2712724))

0.0

In [38]:
import xarray as xr
import cftime

units = 'days since 1950-01-01' 

times = cftime.num2date(np.arange(7), units=units, calendar='365_day')

da = xr.DataArray(np.arange(7), coords=[times], dims=['time'], name='a')

da.to_netcdf('data-noleap.nc')

with xr.set_options(enable_cftimeindex=True):
    cftimeindex_enabled = xr.open_dataset('data-noleap.nc')

In [40]:
ds = xr.open_dataset('../data/sea_level.nc')
df = ds.to_dataframe()

In [46]:
df.head()

                                   global_msl  global_msl_trend  \
time                lat     lon
1993-01-15 00:00:00 -89.875 0.125   -0.001873          2.978008
                            0.375   -0.001873          2.978008
                            0.625   -0.001873          2.978008
                            0.875   -0.001873          2.978008
                            1.125   -0.001873          2.978008

                                   global_msl_trend_error
time                lat     lon
1993-01-15 00:00:00 -89.875 0.125                0.023537
                            0.375                0.023537
                            0.625                0.023537
                            0.875                0.023537
                            1.125                0.023537

In [ ]:
indices =df.index
indice[:3]